# [3] 인덱스 활용
##  예제 1-16

In [1]:
import pandas as pd

In [2]:
exam_data = {'이름':['지성','다은','뽀송'],
             '수학':[90, 80, 70],
             '영어':[98, 89, 95], '음악':[85, 95, 100], '체육':[100, 90, 90]}

In [3]:
df = pd.DataFrame(exam_data)

In [4]:
df

   이름  수학  영어   음악   체육
0  지성  90  98   85  100
1  다은  80  89   95   90
2  뽀송  70  95  100   90

In [5]:
print(df)

   이름  수학  영어   음악   체육
0  지성  90  98   85  100
1  다은  80  89   95   90
2  뽀송  70  95  100   90

In [6]:
 ndf = df.set_index(['이름'])

In [9]:
ndf

    수학  영어   음악   체육
이름
지성  90  98   85  100
다은  80  89   95   90
뽀송  70  95  100   90

## 예제 1-17

In [10]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

In [11]:
df = pd.DataFrame(dict_data, index=['r0','r1','r2'])

In [12]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [13]:
new_index=['r0', 'r1', 'r3', 'r4']
ndf = df.reindex(new_index)

In [14]:
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [15]:
ndf2 = df.reindex(new_index, fill_value = 100)

In [19]:
ndf2

     c0   c1   c2   c3   c4
r0    1    4    7   10   13
r1    2    5    8   11   14
r3  100  100  100  100  100
r4  100  100  100  100  100

## 예제 1-18

In [17]:
ndf3 = df.reset_index()

In [18]:
ndf3

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

## 예제 1-19

In [20]:
ndf4 = ndf3.sort_index(ascending=False)

In [21]:
ndf4

  index  c0  c1  c2  c3  c4
2    r2   3   6   9  12  15
1    r1   2   5   8  11  14
0    r0   1   4   7  10  13

## 예제 1-20

In [22]:
ndf5 = ndf3.sort_values(by='c4', ascending=False)

In [23]:
ndf5

  index  c0  c1  c2  c3  c4
2    r2   3   6   9  12  15
1    r1   2   5   8  11  14
0    r0   1   4   7  10  13

# [4] 산술연산
## 예제 1-21 시리즈 연산

In [25]:
std1 = pd.Series({'국어':100, '영어':80, '수학':90})

In [26]:
std1

국어    100
영어     80
수학     90
dtype: int64

In [27]:
per = std1/200

In [28]:
per

국어    0.50
영어    0.40
수학    0.45
dtype: float64

## 예제 1-22

In [29]:
std1 = pd.Series({'국어':100, '영어':80, '수학':90})
std2 = pd.Series({'영어':70, '수학':50, '국어':10})

In [32]:
add = std1 + std2
sub = std1 - std2
mul = std1 * std2
div = std1 / std2

In [33]:
add

국어    110
수학    140
영어    150
dtype: int64

In [34]:
#사칙연산의 결과를 데이터프레임으로 합치기(시리즈->데이터프레임)
result = pd.DataFrame([add, sub, mul, div], index=['덧셈','뺄셈','곱셈','나눗셈'])

In [35]:
result

         국어      수학           영어
덧셈    110.0   140.0   150.000000
뺄셈     90.0    40.0    10.000000
곱셈   1000.0  4500.0  5600.000000
나눗셈    10.0     1.8     1.142857

## 예제 1-23 시리즈 vs 시리즈

In [48]:
import numpy as np

In [49]:
std1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
std2 = pd.Series({'수학':80, '국어':90})

In [50]:
std1

국어     NaN
영어    80.0
수학    90.0
dtype: float64

In [51]:
std1, std2

(국어     NaN
 영어    80.0
 수학    90.0
 dtype: float64,
 수학    80
 국어    90
 dtype: int64)

In [52]:
add1 = std1 + std2
sub1 = std1 - std2
mul1 = std1 * std2
div1 = std1 / std2

In [53]:
type(div1)

pandas.core.series.Series

In [54]:
#사칙연산의 결과를 데이터프레임으로 합치기(시리즈->데이터프레임)
result1 = pd.DataFrame([add1, sub1, mul1, div1], index=['덧셈','뺄셈','곱셈','나눗셈'])

In [55]:
result1

     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN    10.000 NaN
곱셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

## 예제 1-24 누락데이터 NaN -> 값 대체

In [56]:
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90})

In [59]:
# 두 학생의 과목별 점수로 사칙연산 (add, sub, mul, div 메소드 사용)
sr_add = student1.add(student2, fill_value=0)   #덧셈
sr_sub = student1.sub(student2, fill_value=0)   #뺄셈
sr_mul = student1.mul(student2, fill_value=0)   #곱셈
sr_div = student1.div(student2, fill_value=0)   #나눗셈

In [60]:
result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div],
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈'])

In [61]:
result

              국어        수학    영어
덧셈    190.000000   170.000  80.0
뺄셈     10.000000    10.000  80.0
곱셈   9000.000000  7200.000   0.0
나눗셈     1.111111     1.125   inf

## 예제 1-25 타이타닉 데이터셋

In [1]:
import seaborn as sns

In [2]:
tit = sns.load_dataset('titanic')

In [4]:
tit.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
df = tit.loc[:,['age','fare']]

In [7]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [8]:
add10 = df + 10
add10.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [9]:
type(add10)

pandas.core.frame.DataFrame

## 예제 1-26

In [10]:
sub3 = add10 - df

In [11]:
sub3.tail()

      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0